[{"title":"Locke & Key, Volume 1: Welcome to Lovecraft","author":"Joe Hill","description":"Locke &amp; Key tells of Keyhouse, an unlikely New England mansion, with fantastic doors that transform all who dare to walk through them. Home to a hate-filled and relentless creature that will not rest until it forces open the most terrible door of them all...","isbn":"9781600102370","length":168,"coverUrl":"http://d.gr-assets.com/books/1377304780l/3217221.jpg","goodreadsId":"3217221","_id":"54b9292488f375483c124611","createdAt":"2015-01-16T15:07:16.377Z"},{"title":"Annihilation (Southern Reach Trilogy, #1)","author":"Jeff VanderMeer","description":"Area X has been cut off from the rest of the continent for decades. Nature has reclaimed the last vestiges of human civilization. The first expedition returned with reports of a pristine, Edenic landscape; all the members of the second expedition committed suicide; the third expedition died in a hail of gunfire as its members turned on one another; the members of the eleventh expedition returned as shadows of their former selves, and within months of their return, all had died of aggressive cancer.<br><br>This is the twelfth expedition.<br><br>Their group is made up of four women: an anthropologist; a surveyor; a psychologist, the de facto leader; and our narrator, a biologist. Their mission is to map the terrain and collect specimens; to record all their observations, scientific and otherwise, of their surroundings and of one another; and, above all, to avoid being contaminated by Area X itself.<br><br>They arrive expecting the unexpected, and Area X delivers—they discover a massive topographic anomaly and life forms that surpass understanding—but it’s the surprises that came across the border with them, and the secrets the expedition members are keeping from one another, that change everything.","isbn":"9780374104092","length":195,"coverUrl":"http://d.gr-assets.com/books/1403941587l/17934530.jpg","goodreadsId":"17934530","_id":"54b9292488f375483c124612","createdAt":"2015-01-16T15:07:16.381Z"},{"title":"The Last Policeman (The Last Policeman, #1)","author":"Ben H. Winters","description":"What’s the point in solving murders if we’re all going to die soon, anyway?<br><br>Detective Hank Palace has faced this question ever since asteroid 2011GV1 hovered into view. There’s no chance left. No hope. Just six precious months until impact.<br><br><em>The Last Policeman</em> presents a fascinating portrait of a pre-apocalyptic United States. The economy spirals downward while crops rot in the fields. Churches and synagogues are packed. People all over the world are walking off the job—but not Hank Palace. He’s investigating a death by hanging in a city that sees a dozen suicides every week—except this one feels suspicious, and Palace is the only cop who cares.<br><br>The first in a trilogy, <em>The Last Policeman</em> offers a mystery set on the brink of an apocalypse. As Palace’s investigation plays out under the shadow of 2011GV1, we’re confronted by hard questions way beyond “whodunit.” <em>What basis does civilization rest upon? What is life worth? What would any of us do, what would we really do, if our days were numbered?</em>","isbn":"9781594745768","length":316,"coverUrl":"http://d.gr-assets.com/books/1344370646l/13330370.jpg","goodreadsId":"13330370","_id":"54b9292488f375483c124613","createdAt":"2015-01-16T15:07:16.382Z"},{"title":"This is Where I Leave You","author":"Jonathan Tropper","description":"The death of Judd Foxman’s father marks the first time that the entire Foxman family—including Judd’s mother, brothers, and sister—have been together in years. Conspicuously absent: Judd’s wife, Jen, whose fourteen-month affair with Judd’s radio-shock-jock boss has recently become painfully public.<br><br>Simultaneously mourning the death of his father and the demise of his marriage, Judd joins the rest of the Foxmans as they reluctantly submit to their patriarch’s dying request: to spend the seven days following the funeral together. In the same house. Like a family.<br><br>As the week quickly spins out of control, longstanding grudges resurface, secrets are revealed, and old passions reawakened. For Judd, it’s a weeklong attempt to make sense of the mess his life has become while trying in vain not to get sucked into the regressive battles of his madly dysfunctional family. All of which would be hard enough without the bomb Jen dropped the day Judd’s father died: She’s pregnant.<br><br><em>This Is Where I Leave You</em> is Jonathan Tropper's most accomplished work to date, a riotously funny, emotionally raw novel about love, marriage, divorce, family, and the ties that bind—whether we like it or not.","isbn":"9780525951278","length":339,"coverUrl":"http://d.gr-assets.com/books/1336344327l/6224935.jpg","goodreadsId":"6224935","_id":"54b9292488f375483c124614","createdAt":"2015-01-16T15:07:16.382Z"},{"title":"Harry Potter and the Deathly Hallows (Harry Potter, #7)","author":"J.K. Rowling","description":"Harry is waiting in Privet Drive. The Order of the Phoenix is coming to escort him safely away without Voldemort and his supporters knowing - if they can. But what will Harry do then? How can he fulfill the momentous and seemingly impossible task that Professor Dumbledore has left him?<br>The epic finale to an epic series.","isbn":"9780545010221","length":759,"coverUrl":"http://d.gr-assets.com/books/1370023538l/136251.jpg","goodreadsId":"136251","_id":"54b9292488f375483c124615","createdAt":"2015-01-16T15:07:16.383Z"},{"title":"The Partner Track","author":"Helen Wan","description":"A young attorney must choose between the prestige of partnership and  the American Dream that she — and her immigrant parents — have come so close to achieving in this riveting debut<br><br>In the eyes of her corporate law firm, Ingrid Yung is a \"two-fer.\" As a Chinese-American woman about to be ushered into the elite rank of partner, she's the face of Parsons Valentine &amp; Hunt LLP's recruiting brochures--their treasured \"Golden Girl.\" But behind the firm’s welcoming façade lies the scotch-sipping, cigar-smoking old-boy network that shuts out lawyers like Ingrid. To compensate, Ingrid gamely plays in the softball league, schmoozes in the corporate cafeteria, and puts in the billable hours — until a horrifically offensive performance at the law firm's annual summer outing throws the carefully constructed image way out of equilibrium.  Scrambling to do damage control, Parsons Valentine announces a new \"Diversity Initiative\" and commands a reluctant Ingrid to spearhead the effort, taking her priority away from the enormous deal that was to be the final step in securing partnership. For the first time, Ingrid finds herself at odds with her colleagues — including her handsome, golden-boy boyfriend — in a clash of class, race, and sexual politics.<br><br>\"Smart, incisive, and fast-paced, THE PARTNER TRACK is a sparklingly readable look at the inner workings of a Wall Street law firm -- from the vantage point of a brainy, beautiful and self-doubting Asian-American associate. Wan has the remarkable ability to make you feel as if \"you are there\" -- inside the law firm, inside protagonist Ingrid Yung's head. I did not want to put this book down.\" –Susan Cain, New York Times bestselling author of \"QUIET: The Power of Introverts in a World That Can't Stop Talking\"<br><br>\"A wholly engrossing behind-the-scenes look at real life behind the pomp, power and prestige of a high-powered law firm that wants to still play by a 1950s rule book.\" –Emma McLaughlin &amp; Nicola Kraus, co-authors of \"Citizen Girl\"<br><br>\"Hell hath no fury like Helen Wan's savvy heroine in this terrific debut.  We all know women like Ingrid Yung:  the well-educated over-achiever who does everything right to ensure a long, productive journey on a lucrative career path.  But what happens when someone blows up the path?  The Partner Track is a delicious, satisfying read for anyone who has fantasized about getting the better of the boss, the ex-lover, the corporate powers that be--or all three.  Ingrid Yung has done it for all of us.\" –Kristin van Ogtrop, editor of REAL SIMPLE<br><br>\"Behind Helen Wan's wit and sparkling prose is a poignant and at times, painfully honest tale of loyalty, ambition and sacrifice.  Funny, fragile, sometimes bold, often unsure, Ingrid Yung is one of those unforgettable heroines that you actually miss, like a dear friend, when the story’s over.\" –Ann Leary, New York Times bestselling author of \"The Good House\"<br><br>\"What a terrific debut novel. Ingrid Yung is a fresh, funny, and fearless heroine.  Her razor-sharp wit and keen observations of gender, race and class politics in corporate America make THE PARTNER TRACK an entertaining, engrossing and ultimately deeply compelling read.\" –Cristina Alger, author of \"The Darlings\"<br><br>\"The Partner Track is a marvelous story about female ambition and power, about betrayal, identity, and the conflict between self-interest and desire. In short: all the big, human stuff. Read it.\" –Alison Clement, author of \"Twenty Questions\"","isbn":"9781250019578","length":304,"coverUrl":"http://d.gr-assets.com/books/1364033282l/17286782.jpg","goodreadsId":"17286782","_id":"54b9292488f375483c124616","createdAt":"2015-01-16T15:07:16.383Z"},{"title":"Harry Potter and the Half-Blood Prince (Harry Potter, #6)","author":"J.K. Rowling","description":"This novel takes up the story of Harry Potter's sixth year at Hogwarts School of Witchcraft and Wizardry as Voldemort's power and followers are increasing day by day, in the midst of the battle of good and evil.","isbn":"9781408810583","length":608,"coverUrl":"http://d.gr-assets.com/books/1403558815l/8723736.jpg","goodreadsId":"8723736","_id":"54b9292488f375483c124617","createdAt":"2015-01-16T15:07:16.383Z"},{"title":"Harry Potter and the Order of the Phoenix (Harry Potter, #5)","author":"J.K. Rowling","description":"Dumbledore lowered his hands and surveyed Harry through his half-moon glasses. 'It is time,' he said, 'for me to tell you what I should have told you five years ago, Harry. Please sit down. I am going to tell you everything.' <br><br>Harry Potter is due to start his fifth year at Hogwarts School of Witchcraft and Wizardry. He is desperate to get back to school and find out why his friends Ron and Hermione have been so secretive all summer. However, what Harry is about to discover in his new year at Hogwarts will turn his whole world upside down ...<br><br>But before he even gets to school, Harry has an unexpected and frightening encounter with two Dementors, has to face a court hearing at the Ministry of Magic and has been escorted on a night-time broomstick ride to the secret headquarters of a mysterious group called 'The Order of the Phoenix'. And that is just the start. <br><br>A gripping and electrifying novel, full of suspense, secrets, and - of course - magic.","isbn":"9780747591269","length":766,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"110932","_id":"54b9292488f375483c124618","createdAt":"2015-01-16T15:07:16.384Z"},{"title":"Harry Potter and the Goblet of Fire (Harry Potter, #4)","author":"J.K. Rowling","description":"It is the summer holidays and soon Harry Potter will be starting his fourth year at Hogwarts School of Witchcraft and Wizardry. Harry is counting the days: there are new spells to be learnt, more Quidditch to be played, and Hogwarts castle to continue exploring. But Harry needs to be careful - there are unexpected dangers lurking ...<br><br>","isbn":"9780747550990","length":636,"coverUrl":"http://d.gr-assets.com/books/1328976699l/864890.jpg","goodreadsId":"864890","_id":"54b9292488f375483c124619","createdAt":"2015-01-16T15:07:16.384Z"},{"title":"The Shape of Design","author":"Frank Chimero","description":"\"Hi. My name's Frank Chimero. I've spent the better part of the last two years writing and speaking on design and thinking about the topics that orbit the practice: storytelling, concept, craft, and improvisation. I want to take all of the ideas I've had and connected these past few months and capture them in a book format.<br><br>I've been teaching for the past 5 years, and I've always been a bit frustrated that there isn't a nice, concise book that overviews the mental state of a successful designer while they go through their creative process. For instance, many say that graphic design is visual communication. A cornerstone of communication is storytelling, and yet you'd be hard-pressed to find any discussion of how to tell stories with design in any design book. This should be remedied.<br><br>There are new challenges in the world that need to be discussed, and I think design is a prime lens to consider these topics. As our world moves faster and as things become less stable, it becomes more important for individuals to embrace ambiguity, understand paradox, and realize that two things can conflict and still somehow both be true. We must realize that logic doesn't always work, and that sometimes nonsense is the best answer. These are the topics I intend to address in the book.<br><br>The Shape of Design isn't going to be a text book. The project will be focused on Why instead of How. We have enough How; it's time for a thoughtful analysis of our practice and its characteristics so we can better practice our craft. After reading the book, I want you to look at what you do in a whole new light. Design is more than working for clients.<br><br>But really, this book aims to look at the mindset and worldview that designing develops in order to answer one big, important question: How can we make things that help all of us live better?\"","length":null,"coverUrl":"http://d.gr-assets.com/books/1356713735l/13017981.jpg","goodreadsId":"13017981","_id":"54b9292488f375483c12461a","createdAt":"2015-01-16T15:07:16.385Z"},{"title":"The Martian","author":"Andy Weir","description":"<strong><em>Apollo 13</em> meets <em>Cast Away</em> in this grippingly detailed, brilliantly ingenious man-vs-nature survival thriller, set on the surface of Mars.</strong><br><br>Six days ago, astronaut Mark Watney became one of the first men to walk on the surface of Mars. Now, he's sure he'll be the first man to die there.<br><br>It started with the dust storm that holed his suit and nearly killed him, and that forced his crew to leave him behind, sure he was already dead. Now he's stranded millions of miles from the nearest human being, with no way to even signal Earth that he's alive--and even if he could get word out, his food would be gone years before a rescue mission could arrive. Chances are, though, he won't have time to starve to death. The damaged machinery, unforgiving environment, or plain-old \"human error\" are much more likely to get him first.<br><br>But Mark isn't ready to give up yet. Drawing on his ingenuity, his engineering skills--and a relentless, dogged refusal to quit--he steadfastly confronts one seemingly insurmountable obstacle after the next. But will his resourcefulness be enough to overcome the impossible odds against him?","isbn":"9780804139021","length":369,"coverUrl":"http://d.gr-assets.com/books/1413706054l/18007564.jpg","goodreadsId":"18007564","_id":"54b9292488f375483c12461b","createdAt":"2015-01-16T15:07:16.386Z"},{"title":"Hatching Twitter: A True Story of Money, Power, Friendship, and Betrayal","author":"Nick Bilton","description":"Twitter seems like a perfect start-up success story. In barely six years, a small group of young, ambitious programmers in Silicon Valley built an $11.5 billion business out of the ashes of a failed podcasting company. Today Twitter boasts more than 200 million active users and has affected business, politics, media, and other fields in innumerable ways.<br><br>Now Nick Bilton of the New York Times takes readers behind the scenes with a narrative that shows what happened inside Twitter as it grew at exponential speeds. This is a tale of betrayed friendships and high-stakes power struggles as the four founders—Biz Stone, Evan Williams, Jack Dorsey, and Noah Glass—went from everyday engineers to wealthy celebrities, featured on magazine covers, Oprah, The Daily Show, and Time’s list of the world’s most influential people.<br><br>Bilton’s exclusive access and exhaustive investigative reporting—drawing on hundreds of sources, documents, and internal e-mails—have enabled him to write an intimate portrait of fame, influence, and power. He also captures the zeitgeist and global influence of Twitter, which has been used to help overthrow governments in the Middle East and disrupt the very fabric of the way people communicate.","isbn":"9781591846017","length":299,"coverUrl":"http://d.gr-assets.com/books/1381332539l/18656827.jpg","goodreadsId":"18656827","_id":"54b9292488f375483c12461c","createdAt":"2015-01-16T15:07:16.386Z"},{"title":"A Long Way Down","author":"Nick Hornby","description":"The exhilarating <em>New York Times</em> bestseller from the author of <em>High Fidelity</em>, <em>About a Boy</em>, and <em>How to Be Good</em>.<br><br>\"New Year's Eve at Toppers' House, North London's most popular suicide spot. And four strangers are about to discover that doing away with yourself isn't quite the private act they'd each expected.\" \"Perma-tanned Martin Sharp's a disgraced breakfast TV presenter who had it all - the kids, the wife, the pad, the great career - and wasted it away. Killing himself is Martin's logical and appropriate response to an unliveable life.\" \"Maureen has to do it tonight, because of Matty being in the home. He was never able to do any of the normal things kids do - like walk or talk - and loving-mum Maureen can't cope any more. Dutiful Catholic that she is, she's ready to commit the 'biggest sin of all'.\" \"Half-crazed with heartbreak, loneliness, adolescent angst, seven Bacardi Breezers and two Special Brews, Jess's ready to jump, to fly off the roof.\" \"Finally, there's JJ - tall, cool, American, looks like a rock-star, sometimes thinks he plays his guitar like one - who's weighted down with a heap of problems, and pizza.\" \"Four strangers, who moments before were convinced that they were alone and going to end it all that way, share out the pizza and begin to talk ... Only to find that they have even less in common than first suspected.\" Nick Hornby's A Long Way Down is a novel that asks some of the big questions: about life and death, strangers and friendship, love and pain, and whether a group of losers, and pizza, can really see you through a long, dark night of the soul.","isbn":"9780670915637","length":null,"coverUrl":"http://d.gr-assets.com/books/1357829318l/2278052.jpg","goodreadsId":"2278052","_id":"54b9292488f375483c12461d","createdAt":"2015-01-16T15:07:16.387Z"},{"title":"Time Warped: Unlocking the Mysteries of Time Perception","author":"Claudia Hammond","description":"Time rules our lives, but how much do we really understand it?<br><br>In Time Warped, we meet the people willing to go to extreme lengths to find out. They travel to Costa Rica to find out if hummingbirds can sense the passage of time, they walk towards the edge of a stairwell blindfolded and one man spends two months in an ice cave in total darkness - all in an attempt to fathom the tricks time can play on our minds.<br><br>Drawing on the latest research from psychology, neuroscience and biology, award-winning BBC Radio4 presenter Claudia Hammond delves into the mysteries of time perception. She shows us how to manage time more efficiently, why it speeds up as you get older and, ultimately, how to use the warping of time to our own advantage.","isbn":"9781847677914","length":352,"coverUrl":"http://d.gr-assets.com/books/1380369687l/18591607.jpg","goodreadsId":"18591607","_id":"54b9292488f375483c12461e","createdAt":"2015-01-16T15:07:16.387Z"},{"title":"The Rook (The Checquy Files, #1)","author":"Daniel O'Malley","description":"\"The body you are wearing used to be mine.\" So begins the letter Myfanwy Thomas is holding when she awakes in a London park surrounded by bodies all wearing latex gloves. With no recollection of who she is, Myfanwy must follow the instructions her former self left behind to discover her identity and track down the agents who want to destroy her. <br><br>She soon learns that she is a Rook, a high-ranking member of a secret organization called the Chequy that battles the many supernatural forces at work in Britain. She also discovers that she possesses a rare, potentially deadly supernatural ability of her own. <br><br>In her quest to uncover which member of the Chequy betrayed her and why, Myfanwy encounters a person with four bodies, an aristocratic woman who can enter her dreams, a secret training facility where children are transformed into deadly fighters, and a conspiracy more vast than she ever could have imagined.<br><br>Filled with characters both fascinating and fantastical, THE ROOK is a richly inventive, suspenseful, and often wry thriller that marks an ambitious debut from a promising young writer.","isbn":"9780316098793","length":486,"coverUrl":"http://d.gr-assets.com/books/1327619585l/10836728.jpg","goodreadsId":"10836728","_id":"54b9292488f375483c12461f","createdAt":"2015-01-16T15:07:16.387Z"},{"title":"Harry Potter and the Prisoner of Azkaban (Harry Potter, #3)","author":"J.K. Rowling","description":"Harry Potter is lucky to reach the age of thirteen, since he has already survived the murderous attacks of the feared Dark Lord on more than one occasion. But his hopes for a quiet term concentrating on Quidditch are dashed when a maniacal mass-murderer escapes from Azkaban, pursued by the soul-sucking Dementors who guard the prison. It's assumed that Hogwarts is the safest place for Harry to be. But is it a coincidence that he can feel eyes watching him in the dark, and should he be taking Professor Trelawney's ghoulish predictions seriously?","isbn":"9780439655484","length":435,"coverUrl":"http://d.gr-assets.com/books/1362278317l/5.jpg","goodreadsId":"5","_id":"54b9292488f375483c124620","createdAt":"2015-01-16T15:07:16.388Z"},{"title":"The Catcher in the Rye","author":"J.D. Salinger","description":"Anyone who has read Salinger's New Yorker stories--particularly A Perfect Day for Bananafish, Uncle Wiggily in Connecticut, The Laughing Man &amp; For Esme--With Love &amp; Squalor, won't be surprised by the fact that his 1st novel is full of children. The hero-narrator of The Catcher in the Rye is an ancient child of 16, a native New Yorker named Holden Caulfield. Thru circumstances that tend to preclude adult, 2ndhand description, he leaves his prep school in Pennsylvania &amp; goes underground in NYC for three days. The boy himself is at once too simple &amp; too complex for us to make any final comment about him or his story. Perhaps the safest thing we can say about Holden is that he was born in the world not just strongly attracted to beauty but, almost, hopelessly impaled on it. There are many voices in this novel: children's voices, adult voices, underground voices--but his voice is the most eloquent of all. Transcending his own vernacular, yet remaining marvelously faithful to it, he issues a perfectly articulated cry of mixed pain &amp; pleasure. However, like most lovers &amp; clowns &amp; poets of the higher orders, he keeps most of the pain to, &amp; for, himself. The pleasure he gives away, or sets aside, with all his heart. It's there for the reader who can handle it to keep.","isbn":"9780241950432","length":230,"coverUrl":"http://d.gr-assets.com/books/1280739226l/7933650.jpg","goodreadsId":"7933650","_id":"54b9292488f375483c124621","createdAt":"2015-01-16T15:07:16.388Z"},{"title":"Harry Potter and the Chamber of Secrets (Harry Potter, #2)","author":"J.K. Rowling","description":"The Dursleys were so mean and hideous that summer that all Harry Potter wanted was to get back to the Hogwarts School for Witchcraft and Wizardry. But just as he's packing his bags, Harry receives a warning from a strange, impish creature named Dobby who says that if Harry Potter returns to Hogwarts, disaster will strike.<br><br>And strike it does. For in Harry's second year at Hogwarts, fresh torments and horrors arise, including an outrageously stuck-up new professor, Gilderoy Lockheart, a spirit named Moaning Myrtle who haunts the girls' bathroom, and the unwanted attentions of Ron Weasley's younger sister, Ginny.<br><br>But each of these seem minor annoyances when the real trouble begins, and someone--or something--starts turning Hogwarts students to stone. Could it be Draco Malfoy, a more poisonous rival than ever? Could it possibly be Hagrid, whose mysterious past is finally told? Or could it be the one everyone at Hogwarts most suspects...Harry Potter himself.","isbn":"9780439064866","length":341,"coverUrl":"http://d.gr-assets.com/books/1370043634l/15881.jpg","goodreadsId":"15881","_id":"54b9292488f375483c124622","createdAt":"2015-01-16T15:07:16.388Z"},{"title":"High Fidelity","author":"Nick Hornby","description":"It has been said often enough that baby boomers are a television generation, but the very funny novel <em>High Fidelity</em> reminds that in a way they are the record-album generation as well. This funny novel is obsessed with music; Hornby's narrator is an early-thirty-something English guy who runs a London record store. He sells albums recorded the old-fashioned way-on vinyl-and is having a tough time making other transitions as well, specifically adulthood. The book is in one sense a love story, both sweet and interesting; most entertaining, though, are the hilarious arguments over arcane matters of pop music.","isbn":"9780140293463","length":245,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"595413","_id":"54b9292488f375483c124623","createdAt":"2015-01-16T15:07:16.388Z"},{"title":"Imperial Bedrooms","author":"Bret Easton Ellis","description":"Twenty-five years on from <em>\"Less Than Zero\"</em>, we pick up again with <em>\"Clay\".</em> <br><br>In 1985, Bret Easton Ellis shocked, stunned and disturbed with <em>\"Less Than Zero\"</em>, his 'extraordinarily accomplished first novel' (\"New Yorker\"), successfully chronicling the frightening consequences of unmitigated hedonism within the ranks of the ethically bereft youth of 80s Los Angeles. Now, twenty-five years later, Ellis returns to those same characters: to Clay and the band of infamous teenagers whose lives weave sporadically through his. <br><br>But now, some years on, they face an even greater period of disaffection: their own middle age. Clay seems to have moved on - he's become a successful screenwriter - but when he returns from New York to Los Angeles, to help cast his new movie, he's soon drifting through a long-familiar circle. Blair, his former girlfriend, is now married to Trent, and their Beverly Hills parties attract excessive levels of fame and fortune, though for all that Trent is a powerful manager, his baser instincts remain: he's still a bisexual philanderer.  <br><br>Then there's Clay's childhood friend, Julian - who's now a recovering addict - and their old dealer, Rip - face-lifted beyond recognition and seemingly even more sinister than he was in his notorious past. Clay, too, struggles with his own demons after a meeting with a gorgeous actress determined to win a role in his movie. And with his life careening out of control, he's forced to come to terms with the deepest recesses of his character - and with his seemingly endless proclivity for betrayal.","isbn":"9780330517096","length":256,"coverUrl":"http://d.gr-assets.com/books/1278878105l/7519866.jpg","goodreadsId":"7519866","_id":"54b9292488f375483c124624","createdAt":"2015-01-16T15:07:16.389Z"},{"title":"The Circle","author":"Dave Eggers","description":"When Mae Holland is hired to work for the Circle, the world’s most powerful internet company, she feels she’s been given the opportunity of a lifetime. The Circle, run out of a sprawling California campus, links users’ personal emails, social media, banking, and purchasing with their universal operating system, resulting in one online identity and a new age of civility and transparency. As Mae tours the open-plan office spaces, the towering glass dining facilities, the cozy dorms for those who spend nights at work, she is thrilled with the company’s modernity and activity. There are parties that last through the night, there are famous musicians playing on the lawn, there are athletic activities and clubs and brunches, and even an aquarium of rare fish retrieved from the Marianas Trench by the CEO. Mae can’t believe her luck, her great fortune to work for the most influential company in America--even as life beyond the campus grows distant, even as a strange encounter with a colleague leaves her shaken, even as her role at the Circle becomes increasingly public. What begins as the captivating story of one woman’s ambition and idealism soon becomes a heart-racing novel of suspense, raising questions about memory, history, privacy, democracy, and the limits of human knowledge.","isbn":"9780385351393","length":508,"coverUrl":"http://d.gr-assets.com/books/1376419833l/18302455.jpg","goodreadsId":"18302455","_id":"54b9292488f375483c124625","createdAt":"2015-01-16T15:07:16.389Z"},{"title":"Saga, Volume 2 (Saga #7-12)","author":"Brian K. Vaughan","description":"<p>From award-winning writer BRIAN K. VAUGHAN (<em>Pride of Baghdad, Ex Machina</em>) and critically acclaimed artist FIONA STAPLES (<em>Mystery Society, Done to Death</em>), SAGA is sweeping tale of one young family fighting to find their place in the universe.  Thanks to her star-crossed parents Marko and Alana, newborn baby Hazel has already survived lethal assassins, rampaging armies, and horrific monsters, but in the cold vastness of outer space, the little girl encounters her strangest adventure yet... grandparents.<br><br>Collects Saga issues #7-12</p>","isbn":"9781607066927","length":144,"coverUrl":"http://d.gr-assets.com/books/1365883331l/17131869.jpg","goodreadsId":"17131869","_id":"54b9292488f375483c124626","createdAt":"2015-01-16T15:07:16.390Z"},{"title":"Saga, Volume 1 (Saga #1-6)","author":"Brian K. Vaughan","description":"When two soldiers from opposite sides of a never-ending galactic war fall in love, they risk everything to bring a fragile new life into a dangerous old universe. <br><br>From New York Times bestselling writer Brian K. Vaughan (Y: The Last Man, Ex Machina) and critically acclaimed artist Fiona Staples (Mystery Society, North 40), <em>Saga</em> is the sweeping tale of one young family fighting to find their place in the worlds. Fantasy and science fiction are wed like never before in this sexy, subversive drama for adults. <br><br>This specially priced volume collects the first six issues of the smash-hit series The Onion A.V. Club calls \"the emotional epic Hollywood wishes it could make.\"<br><br>Collects Saga issues #1-6.","isbn":"9781607066019","length":160,"coverUrl":"http://d.gr-assets.com/books/1351259514l/15704307.jpg","goodreadsId":"15704307","_id":"54b9292488f375483c124627","createdAt":"2015-01-16T15:07:16.390Z"},{"title":"Harry Potter and the Sorcerer's Stone (Harry Potter, #1)","author":"J.K. Rowling","description":"Harry Potter has never played a sport while flying on a broomstick. He's never worn a Cloak of Invisibility, befriended a giant, or helped hatch a dragon. All Harry knows is a miserable life with the Dursleys, his horrible aunt and uncle, and their abominable son, Dudley. Harry's room is a tiny cupboard under the stairs, and he hasn't had a birthday party in ten years.<br><br>But all that is about to change when a mysterious letter arrives by owl messenger: a letter with an invitation to a wonderful place he never dreamed existed. There he finds not only friends, aerial sports, and magic around every corner, but a great destiny that's been waiting for him... if Harry can survive the encounter.","isbn":"9780439554930","length":310,"coverUrl":"http://d.gr-assets.com/books/1361572757l/3.jpg","goodreadsId":"3","_id":"54b9292488f375483c124628","createdAt":"2015-01-16T15:07:16.390Z"},{"title":"American Psycho","author":"Bret Easton Ellis","description":"Patrick Bateman is twenty-six and works on Wall Street; he is handsome, sophisticated, charming and intelligent. He is also a psychopath. Taking us to a head-on collision with America's greatest dream - and its worst nightmare - American Psycho is a bleak, bitter, black comedy about a world we all recognize but do not with to confront.","isbn":"9781447202752","length":416,"coverUrl":"http://d.gr-assets.com/books/1328799685l/13477441.jpg","goodreadsId":"13477441","_id":"54b9292488f375483c124629","createdAt":"2015-01-16T15:07:16.390Z"},{"title":"Annabel Scheme","author":"Robin Sloan","description":"Annabel Scheme is a detective story set in an alternate San Francisco where the digital and the occult live side-by-side. It's a short, snappy read -- about 128 pages/128,000 Kindle locations -- and perfect for people who like Sherlock Holmes, Douglas Adams, ghosts and/or the internet. Finally, it makes a great Kindle gift. In Scheme's San Francisco, an indie rocker's new tracks are climbing the charts, even though the rocker herself is long dead. A devout gamer has gone missing, and the only trace of him that remains is inside his favorite game, the blockbuster MMORPG called World of Jesus. And the richest man in the city, the inventor of the search engine called Grail, might just have made a deal with a devil. Meanwhile, Annabel Scheme has just hired herself a Watson, an A.I. assistant who's now learning the ropes on a case that will quickly transform into Scheme's biggest -- and possibly her last.<br><br>Come on. Fog City is waiting.","length":111,"coverUrl":"http://d.gr-assets.com/books/1261937437l/7428549.jpg","goodreadsId":"7428549","_id":"54b9292488f375483c12462a","createdAt":"2015-01-16T15:07:16.391Z"},{"title":"Ajax Penumbra 1969","author":"Robin Sloan","description":"<em>From Robin Sloan, author of </em>Mr. Penumbra’s 24-Hour Bookstore, <em>the story of Mr. Penumbra’s first trip to San Francisco—and of how he got entangled with the city’s most unusual always-open enterprise…</em><br><br>It is August 1969. The Summer of Love is a fading memory. The streets of San Francisco pulse to the sounds of Led Zeppelin and Marvin Gaye. And of jackhammers: A futuristic pyramid of a skyscraper is rising a few blocks from City Lights bookstore and an unprecedented subway tunnel is being built under the bay. Meanwhile, south of the city, orchards are quickly giving way to a brand-new industry built on silicon.<br>But young Ajax Penumbra has not arrived in San Francisco looking for free love or a glimpse of the technological future. He is seeking a book—the single surviving copy of the<em> Techne Tycheon</em>,<em> </em>a mysterious volume that has brought and lost great fortune for anyone who has owned it. The last record of the book locates it in the San Francisco of more than a century earlier, and on that scant bit of evidence, Penumbra’s university has dispatched him west to acquire it for their library. After a few weeks of rigorous hunting, Penumbra feels no closer to his goal than when he started. But late one night, after another day of dispiriting dead ends, he stumbles across a 24-hour bookstore, and the possibilities before him expand exponentially . . .","isbn":"9780374711849","length":96,"coverUrl":"http://d.gr-assets.com/books/1378499834l/18403000.jpg","goodreadsId":"18403000","_id":"54b9292488f375483c12462b","createdAt":"2015-01-16T15:07:16.391Z"},{"title":"The Master Switch: The Rise and Fall of Information Empires","author":"Tim Wu","description":"It is easy to forget that every development in the history of the American information industry–from the telephone to radio to film–once existed in an open and chaotic marketplace inhabited by entrepreneurs and utopians, just as the Internet does today. Each of these, however, grew to be dominated by a monopolist or cartel. In this pathbreaking book, Tim Wu asks: will the Internet follow the same fate? Could the Web–the entire flow of American information–come to be ruled by a corporate leviathan in possession of \"the master switch\"?<br><br>Analyzing the strategic maneuvers of today’s great information powers–Apple, Google, and an eerily resurgent AT&amp;T–Wu uncovers a time-honored pattern in which invention begets industry and industry begets empire. He shows how a battle royale for Internet’s future is brewing, and this is one war we dare not tune out","isbn":"9780307390998","length":384,"coverUrl":"http://d.gr-assets.com/books/1333576506l/10416731.jpg","goodreadsId":"10416731","_id":"54b9292488f375483c12462c","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"Reflex (Jumper, #2)","author":"Steven Gould","description":"Davy has always been alone. He believes that he's the only person in the world who can teleport. But what if he isn't?<br><br>A mysterious group of people has taken Davy captive. They don't want to hire him, and they don't have any hope of appealing to him to help them. What they want is to own him. They want to use his abilities for their own purposes, whether Davy agrees to it or not. And so they set about brainwashing him and conditioning him. They have even found a way to keep a teleport captive.<br><br>But there's one thing that they don't know. No one knows it, not even Davy. And it might save his life....<br>","isbn":"9780812578546","length":380,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"64818","_id":"54b9292488f375483c12462d","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"Jumper (Jumper, #1)","author":"Steven Gould","description":"Davy lives alone with his father. But the truth is, it isn't much of a home. When things get so bad that Davy decides to run away, his big question is, Where? And how will he live?<br><br>The magical answer: anywhere Davy wants!<br><br>Davy discovers he has the power to \"jump\" from one place to another. Not just a few feet.  But hundreds, even thousands of miles! And as Davy explores his new power he learns that the world is literally his for the taking. But there are consequences too, as Davy will learn.","isbn":"9780765342287","length":345,"coverUrl":"http://d.gr-assets.com/books/1304981770l/47970.jpg","goodreadsId":"47970","_id":"54b9292488f375483c12462e","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"Learning from First Responders: When Your Systems Have to Work","author":"Dylan Richard","description":"One of the side stories of the 2012 presidential campaign was the success of Obama's software team. The team built their software in-house, and put into practice many ideas from the DevOps world. Game day was one of the most important: an exercise in which part of the team tried as hard as possible to break their systems, while the rest of the team tried to keep things running. They simulated everything from database failure to massive network outages. And as a result, when the election came, they were certain that they could respond to any crisis.","isbn":"9781449366582","length":null,"coverUrl":"http://d.gr-assets.com/books/1386580241l/17553704.jpg","goodreadsId":"17553704","_id":"54b9292488f375483c12462f","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"The Unincorporated Man","author":"Dani Kollin","description":"<div>\n  <p><em>The Unincorporated Man</em> is a provocative social/political/economic novel that takes place in the future, after civilization has fallen into complete economic collapse. This reborn civilization is one in which every individual is incorporated at birth, and spends many years trying to attain control over his or her own life by getting a majority of his or her own shares. Life extension has made life very long indeed.<br><br>Now the incredible has happened: a billionaire businessman from our time, frozen in secret in the early twenty-first century, is discovered and resurrected, given health and a vigorous younger body. Justin Cord is the only unincorporated man in the world, a true stranger in this strange land. Justin survived because he is tough and smart. He cannot accept only part ownership of himself, even if that places him in conflict with a civilization that extends outside the solar system to the Oort Cloud.  People will be arguing about this novel and this world for decades.</p>\n</div>","isbn":"9780765318992","length":479,"coverUrl":"http://d.gr-assets.com/books/1312055153l/4025200.jpg","goodreadsId":"4025200","_id":"54b9292488f375483c124630","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"If at First . . .","author":"Peter F. Hamilton","description":"Peter F. Hamilton has proven himself a modern master of epic space opera, carrying the tradition of far-future empire building begun by Heinlein and Asimov into the new millennium. But Hamilton is also a master of the short story, and when he tackles one of science fiction's most enduring themes-time travel-the result is as provocative as it is entertaining. It starts in 2007 with a break-in. The victim: Marcus Orthew, the financial and technological genius behind Orthanics, the computer company whose radical products have delivered a one-two punch to the industry, all but knocking PCs and Macs out of the ring. The perpetrator: a man obsessed with Orthew. Just another simple case of celebrity stalking-or so everyone assumes at first, including Metropolitan Police Chief Detective David Lanson. But when Lanson interviews the suspect, he makes a startling claim: Orthew is from the future. Or, rather, a future-a parallel timeline. Thus begins the ride of a lifetime for Lanson, as his pursuit of the facts tumbles him headlong down a rabbit hole-and the hunter finds himself hunted.<br><br>Originally published in The Solaris Book of New Science Fiction, edited by George Mann and published by Solaris Oxford, UK, in 2007.","length":32,"coverUrl":"http://d.gr-assets.com/books/1328161996l/11820585.jpg","goodreadsId":"11820585","_id":"54b9292488f375483c124631","createdAt":"2015-01-16T15:07:16.392Z"},{"title":"The Boy Kings: A Journey into the Heart of the Social Network","author":"Katherine Losse","description":"Kate Losse was a grad school refugee when she joined Facebook as employee #51 in 2005. Hired to answer user questions such as &amp;#8220;What is a poke?&amp;#8221; and &amp;#8220;Why can&amp;#8217;t I access my ex-girlfriend&amp;#8217;s profile?&amp;#8221; her early days at the company were characterized by a sense of camaraderie, promise, and ambition: Here was a group of scrappy young upstarts on a mission to rock Silicon Valley and change the world. <br><br>Over time, this sense of mission became so intense that working for Facebook felt like more than just a job; it implied a wholehearted dedication to &amp;#8220;the cause.&amp;#8221; Employees were incentivized to live within one mile of the office, summers were spent carousing at the company pool house, and female employees were told to wear T-shirts with founder Mark Zuckerberg&amp;#8217;s profile picture on his birthday. Losse started to wonder what this new medium meant for real-life relationships: Would Facebook improve our social interactions? Or would we all just adapt our behavior to the habits and rules of these brilliant but socially awkward Internet savants who have become today&amp;#8217;s youngest power players? Increasingly skeptical, Losse graduated from customer service to the internationalization team&amp;#8212;tasked with rolling out Facebook to the rest of the world&amp;#8212; finally landing a seat right outside Zuckerberg&amp;#8217;s office as his personal ghostwriter, the voice of the boy king. <br><br>This book takes us for the first time into the heart of this fast-growing information empire, inviting us to high-level meetings with Zuckerberg; lifting the veil on long nights of relentless hacking and trolling; taking us behind the scenes of raucous company parties; and introducing us to the personalities, values, and secret ambitions of the floppy-haired boy wonders who are redefining the way we live, love, and work. By revealing here what&amp;#8217;s really driving both the business and the culture of the social network, Losse answers the biggest question of all: What kind of world is Facebook trying to build, and is it the world we want to live in?&amp;nbsp; <br><br>*** <br><br>&amp;#8220;Logging on to Facebook that first day, in retrospect, was the second, and to date the last, time that any technology has captured my imagination. The first was when Apple advertised the first laptop, the PowerBook, in the 1990s&amp;#8212;with the words, &amp;#8216;What&amp;#8217;s on your PowerBook?&amp;#8217; <br><br>&amp;#8220;&amp;#8216;World domination,&amp;#8217; my teenaged self- answered instinctively. That&amp;#8217;s what these devices were made for, I thought: so small and yet so powerful, so capable of linking quickly to and between everything else in the world. From the laptop, I could write and distribute information faster than ever before. It was intoxicating to imagine, and Facebook&amp;#8217;s sudden, faithful rendering in 2004 of the physical world into the virtual felt the same. What could you do, now that you could see and connect to everyone and everything, instantly? <br><br>&amp;#8220;But what, also, could be diminished by such quick access? In the realm of ideas, it seemed easy: Who wouldn&amp;#8217;t want to distribute and discuss ideas widely? However, in the realm of the personal, it seemed more complicated. What was the benefit of doing everything in public? Is information itself neutral, or do different types of information have different values, different levels of expectation of privacy, different implications for distribution and consumption? Should all information be shared equally quickly and without regard to my relationship to it? And, finally, and most important, as we ask whenever we begin a new relationship with anything, would this be good for me?&amp;#8221; <br><br><em>--&amp;nbsp;From the Introduction </em><br><br>&amp;nbsp;","isbn":"9781451668254","length":256,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"13573517","_id":"54b9292488f375483c124632","createdAt":"2015-01-16T15:07:16.393Z"},{"title":"Impulse (Jumper, #3)","author":"Steven Gould","description":"Steven Gould returns to the world of his classic novel <em>Jumper</em> in the thrilling sequel <em>Impulse.</em><br><br><em></em>Cent has a secret. She lives in isolation, with her parents, hiding from the people who took her father captive and tortured him to gain control over his ability to teleport, and from the government agencies who want to use his talent. Cent has seen the world, but only from the safety of her parents’ arms. She’s teleported more than anyone on Earth, except for her mother and father, but she’s never been able to do it herself. Her life has never been in danger. <br><br>Until the day when she went snowboarding without permission and triggered an avalanche. When the snow and ice thundered down on her, she suddenly found herself in her own bedroom. That was the first time.","isbn":"9780765327574","length":368,"coverUrl":"http://d.gr-assets.com/books/1342631587l/13614730.jpg","goodreadsId":"13614730","_id":"54b9292488f375483c124633","createdAt":"2015-01-16T15:07:16.393Z"},{"title":"The Spectacular Now","author":"Tim Tharp","description":"This National Book Award Finalist is now a major motion picture -- one of the most buzzed-about films at Sundance 2013, starring Shailene Woodley and Miles Teller.<br><br>SUTTER KEELY. HE’S the guy you want at your party. He’ll get everyone dancing. He’ ll get everyone in your parents’ pool. Okay, so he’s not exactly a shining academic star. He has no plans for college and will probably end up folding men’s shirts for a living. But there are plenty of ladies in town, and with the help of Dean Martin and Seagram’s V.O., life’s pretty fabuloso, actually.<br><br> Until the morning he wakes up on a random front lawn, and he meets Aimee. Aimee’s clueless. Aimee is a social disaster. Aimee needs help, and it’s up to the Sutterman to show Aimee a splendiferous time and then let her go forth and prosper. But Aimee’s not like other girls, and before long he’s in way over his head. For the first time in his life, he has the power to make a difference in someone else’s life—or ruin it forever.","isbn":"9780375851797","length":304,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"3798703","_id":"54b9292488f375483c124634","createdAt":"2015-01-16T15:07:16.393Z"},{"title":"This Book is about Travel","author":"Andrew  Hyde","description":"This Book is about Travel","isbn":"9780985701529","length":null,"coverUrl":"http://d.gr-assets.com/books/1339334618l/15407306.jpg","goodreadsId":"15407306","_id":"54b9292488f375483c124635","createdAt":"2015-01-16T15:07:16.393Z"},{"title":"The Age of Miracles","author":"Karen Thompson Walker","description":"<em>“It still amazes me how little we really knew. . . . Maybe everything that happened to me and my family had nothing at all to do with the slowing. It’s possible, I guess. But I doubt it. I doubt it very much.”</em><br><br>Luminous, haunting, unforgettable, <em>The Age of Miracles</em> is a stunning fiction debut by a superb new writer, a story about coming of age during extraordinary times, about people going on with their lives in an era of profound uncertainty.<br><br>On a seemingly ordinary Saturday in a California suburb, 11-year-old Julia and her family awake to discover, along with the rest of the world, that the rotation of the earth has suddenly begun to slow. The days and nights grow longer and longer, gravity is affected, the environment is thrown into disarray. Yet as she struggles to navigate an ever-shifting landscape, Julia is also coping with the normal disasters of everyday life--the fissures in her parents’ marriage, the loss of old friends, the hopeful anguish of first love, the bizarre behavior of her grandfather who, convinced of a government conspiracy, spends his days obsessively cataloging his possessions. As Julia adjusts to the new normal, the slowing inexorably continues.<br><br>With spare, graceful prose and the emotional wisdom of a born storyteller, Karen Thompson Walker has created a singular narrator in Julia, a resilient and insightful young girl, and a moving portrait of family life set against the backdrop of an utterly altered world.","isbn":"9780812983609","length":294,"coverUrl":"http://d.gr-assets.com/books/1342487370l/12401556.jpg","goodreadsId":"12401556","_id":"54b9292488f375483c124636","createdAt":"2015-01-16T15:07:16.393Z"},{"title":"Péplum","author":"Amélie Nothomb","description":"L'ensevelissement de Pompéi sous les cendres du Vésuve, en 79 après Jésus-Christ, a été le plus beau cadeau qui ait été offert aux archéologues. A votre avis, qui a fait le coup ? Pour avoir deviné un des plus grands secrets du futur, la jeune romancière A. N. est enlevée pendant un bref séjour à l'hôpital, et se réveille au xxvie siècle, face à un savant du nom de Celsius. Entre ces deux personnages que tout oppose, elle, furieuse contre ce rapt, lui, contre cette fille qui en sait trop s'instaure une conversation où il sera question de la grande guerre du xxiie siècle, du réel et du virtuel, de voyages dans le passé, mais aussi d?art, de philosophie, de morale. Science-fiction, satire, finesse psychologique d'un affrontement verbal où chacun cherche la faille de l'autre : dans ce mélange détonant on retrouve l'humour acide, l'insolence, l?éclat du style qui placent la romancière d?Hygiène de l?assassin au tout premier rang des écrivains de sa génération.","isbn":"9782253144892","length":153,"coverUrl":"http://d.gr-assets.com/books/1358734466l/75522.jpg","goodreadsId":"75522","_id":"54b9292488f375483c124637","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"These Days","author":"Jack Cheng","description":"Connor Vast designs fake computer interfaces. Not the ones you see in sci-fi movies or primetime crime dramas, though he's worked on a couple of those in the past. The interfaces he designs tend to be static: they are the screens for prop computers in furniture showrooms. Young creative professional, child of the internet, refugee of the suburban Midwest, Connor goes about his life and work in New York City with a stream of status updates flowing constantly in the background. He meets K, a gamine twenty-four-year-old who doesn't own a cellphone. As he gets to know her, Connor realizes he's strayed from his younger ambitions of designing real interfaces, working on real technology. He soon falls in with a group of entrepreneurs out to invent the future, but it’s the same future K is so adamantly against. <br><br>THESE DAYS is a foray into the world of startups and an examination of the human side of technology, of both the makers and the end users, who are often one and the same. It's about finding happiness and fulfillment in the digital age; a meditation on time, memory, and things gained and lost in an accelerating world.","isbn":"9781482692419","length":368,"coverUrl":"http://d.gr-assets.com/books/1365800626l/17664652.jpg","goodreadsId":"17664652","_id":"54b9292488f375483c124638","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"Structure and Interpretation of Computer Programs","author":"Harold Abelson","description":"Structure and Interpretation of Computer Programs has had a dramatic impact on computer science curricula over the past decade. This long-awaited revision contains changes throughout the text.There are new implementations of most of the major programming systems in the book, including the interpreters and compilers, and the authors have incorporated many small changes that reflect their experience teaching the course at MIT since the first edition was published.A new theme has been introduced that emphasizes the central role played by different approaches to dealing with time in computational models: objects with state, concurrent programming, functional programming and lazy evaluation, and nondeterministic programming. There are new example sections on higher-order procedures in graphics and on applications of stream processing in numerical programming, and many new exercises.In addition, all the programs have been reworked to run in any Scheme implementation that adheres to the IEEE standard.","isbn":"9780262510875","length":657,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"43713","_id":"54b9292488f375483c124639","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"Slaughterhouse-Five","author":"Kurt Vonnegut","description":"<strong>Slaughterhous-Five</strong> is one of the world's great anti-war books. Centering on the infamous fire-bombing of Dresden, Billy Pilgrim's odyssey through time reflects the mythic journey of our own fractured lives as we search for meaning in what we are afraid to know.","isbn":"9780440180296","length":215,"coverUrl":"http://d.gr-assets.com/books/1415743975l/168646.jpg","goodreadsId":"168646","_id":"54b9292488f375483c12463a","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"Close to the Machine: Technophilia and Its Discontents","author":"Ellen Ullman","description":"Here is a candid account of the life of a software engineer who runs her own computer consulting business out of a live-work loft in San Francisco’s Multimedia Gulch. Immersed in the abstract world of information, algorithms, and networks, she would like to give in to the seductions of the programmer’s world, where “weird logic dreamers” like herself live “close to the machine.” Still, she is keenly aware that body and soul are not mechanical: desire, love, and the need to communicate face to face don’t easily fit into lines of codes or clicks in a Web browser. At every turn, she finds she cannot ignore the social and philosophical repercussions of her work. As Ullman sees it, the cool world of cyber culture is neither the death of civilization nor its salvation—it is the vulnerable creation of people who are not so sure of just where they’re taking us all.<br><br>Ellen Ullman has worked as a software engineer and consultant since 1978. She is the author of The Bug and her writing has been published in Resisting the Virtual Life, Wired Woman, and in Harper’s Magazine. She is a commentator on National Public Radio’s “All Things Considered.”\"","isbn":"9780872863323","length":189,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"486625","_id":"54b9292488f375483c12463b","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"The Perks of Being a Wallflower","author":"Stephen Chbosky","description":"Charlie is a freshman.<br><br>And while he's not the biggest geek in the school, he is by no means popular. Shy, introspective, intelligent beyond his years yet socially awkward, he is a wallflower, caught between trying to live his life and trying to run from it.<br><br>Charlie is attempting to navigate his way through uncharted territory: the world of first dates and mix tapes, family dramas and new friends; the world of sex, drugs, and <em>The Rocky Horror Picture Show</em>, when all one requires is that perfect song on that perfect drive to feel infinite. But he can't stay on the sideline forever. Standing on the fringes of life offers a unique perspective. But there comes a time to see what it looks like from the dance floor.<br><br><em>The Perks of Being a Wallflower</em> is a deeply affecting coming-of-age story that will spirit you back to those wild and poignant roller-coaster days known as growing up.","isbn":"9780671027346","length":213,"coverUrl":"http://d.gr-assets.com/books/1363910637l/22628.jpg","goodreadsId":"22628","_id":"54b9292488f375483c12463c","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"Mr. Penumbra's 24-Hour Bookstore","author":"Robin Sloan","description":"The Great Recession has shuffled Clay Jannon away from life as a San Francisco web-design drone and into the aisles of Mr. Penumbra’s 24-Hour Bookstore. But after a few days on the job, Clay discovers that the store is more curious than either its name or its gnomic owner might suggest. The bookstore’s secrets extend far beyond its walls.","isbn":"9780374214913","length":288,"coverUrl":"http://d.gr-assets.com/books/1345089845l/13538873.jpg","goodreadsId":"13538873","_id":"54b9292488f375483c12463d","createdAt":"2015-01-16T15:07:16.394Z"},{"title":"The Silver Linings Playbook","author":"Matthew Quick","description":"Meet Pat. Pat has a theory: his life is a movie produced by God. And his God-given mission is to become physically fit and emotionally literate, whereupon God will ensure a happy ending for him -- the return of his estranged wife Nikki. (It might not come as a surprise to learn that Pat has spent time in a mental health facility.) The problem is, Pat's now home, and everything feels off. No one will talk to him about Nikki; his beloved Philadelphia Eagles keep losing; he's being pursued by the deeply odd Tiffany; his new therapist seems to recommend adultery as a form of therapy. Plus, he's being hunted by Kenny G!<br><br>In this enchanting novel, Matthew Quick takes us inside Pat's mind, showing us the world from his distorted yet endearing perspective. As the award-winning novelist Justin Cronin put it: \"Tender, soulful, hilarious, and true, <em>The Silver Linings Playbook</em> is a wonderful debut.\"","isbn":"9780374533571","length":289,"coverUrl":"http://d.gr-assets.com/books/1358277412l/13539044.jpg","goodreadsId":"13539044","_id":"54b9292488f375483c12463e","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"A Princess of Mars (Barsoom, #1)","author":"Edgar Rice Burroughs","description":"Suddenly projected to Mars, John Carter found himself captive of the savage green men of Thark. With him was Dejah Thoris, lovely Princess of Helium. And between them and rescue lay a thousand miles of deadly enemies and unknown dangers.","isbn":"9780345331380","length":160,"coverUrl":"http://d.gr-assets.com/books/1347525971l/787282.jpg","goodreadsId":"787282","_id":"54b9292488f375483c12463f","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"How I Killed Pluto and Why It Had It Coming","author":"Mike Brown","description":"The solar system most of us grew up with included nine planets, with Mercury closest to the sun and Pluto at the outer edge. Then, in 2005, astronomer Mike Brown made the discovery of a lifetime: a tenth planet, Eris, slightly bigger than Pluto. But instead of its resulting in one more planet being added to our solar system, Brown’s find ignited a firestorm of controversy that riled the usually sedate world of astronomy and launched him into the public eye. The debate culminated in the demotion of Pluto from real planet to the newly coined category of “dwarf” planet. Suddenly Brown was receiving hate mail from schoolchildren and being bombarded by TV reporters—all because of the discovery he had spent years searching for and a lifetime dreaming about.<br><br>Filled with both humor and drama, <em>How I Killed Pluto and Why It Had It Coming</em> is Mike Brown’s engaging first-person account of the most tumultuous year in modern astronomy—which he inadvertently caused. As it guides readers through important scientific concepts and inspires us to think more deeply about our place in the cosmos, it is also an entertaining and enlightening personal story: While Brown sought to expand our understanding of the vast nature of space, his own life was changed in the most immediate, human ways by love, birth, and death. A heartfelt and personal perspective on the demotion of everyone’s favorite farflung planet, <em>How I Killed Pluto and Why It Had It Coming</em> is the book for anyone, young or old, who has ever dreamed of exploring the universe—and who among us hasn’t?","isbn":"9780385531085","length":267,"coverUrl":"http://d.gr-assets.com/books/1320532443l/7963278.jpg","goodreadsId":"7963278","_id":"54b9292488f375483c124640","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"The Stand","author":"Stephen King","description":"This is the way the world ends: with a nanosecond of computer error in a Defense Department laboratory and a million casual contacts that form the links in a chain letter of death.<br><br>And here is the bleak new world of the day after: a world stripped of its institutions and emptied of 99 percent of its people. A world in which a handful of panicky survivors choose sides -- or are chosen. A world in which good rides on the frail shoulders of the 108-year-old Mother Abagail -- and the worst nightmares of evil are embodied in a man with a lethal smile and unspeakable powers: Randall Flagg, the dark man.<br><br>In 1978 Stephen King published <em>The Stand</em>, the novel that is now considered to be one of his finest works. But as it was first published, <em>The Stand</em> was incomplete, since more than 150,000 words had been cut from the original manuscript.<br><br>Now Stephen King's apocalyptic vision of a world blasted by plague and embroiled in an elemental struggle between good and evil has been restored to its entirety. <em>The Stand</em> : <em>The Complete And Uncut Edition</em> includes more than five hundred pages of material previously deleted, along with new material that King added as he reworked the manuscript for a new generation. It gives us new characters and endows familiar ones with new depths. It has a new beginning and a new ending. What emerges is a gripping work with the scope and moral complexity of a true epic.<br><br>For hundreds of thousands of fans who read <em>The Stand</em> in its original version and wanted more, this new edition is Stephen King's gift. And those who are reading <em>The Stand</em> for the first time will discover a triumphant and eerily plausible work of the imagination that takes on the issues that will determine our survival.","isbn":"9780385199575","length":1153,"coverUrl":"http://d.gr-assets.com/books/1213131305l/149267.jpg","goodreadsId":"149267","_id":"54b9292488f375483c124641","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"Scott Pilgrim Gets It Together (Scott Pilgrim, #4)","author":"Bryan Lee O'Malley","description":"Don't look now, but Scott Pilgrim may actually be getting it together. And it's a good thing, too, because Scott is about to confront Ramona's most intimidating ex yet!","isbn":"9781932664492","length":205,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"744615","_id":"54b9292488f375483c124642","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"Scott Pilgrim's Precious Little Life (Scott Pilgrim, #1)","author":"Bryan Lee O'Malley","description":"Scott Pilgrim's life is totally sweet. He's 23 years old, he's in a rockband, he's \"\"between jobs,\"\" and he's dating a cute high school girl. Nothingcould possibly go wrong, unless a seriously mind-blowing, dangerouslyfashionable, rollerblading delivery girl named Ramona Flowers starts cruisingthrough his dreams and sailing by him at parties. Will Scott's awesome life getturned upside-down? Will he have to face Ramona's seven evil ex-boyfriends inbattle? The short answer is yes. The long answer is Scott Pilgrim, Volume 1: Scott Pilgrim's Precious Little Life","isbn":"9781932664089","length":168,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"29800","_id":"54b9292488f375483c124643","createdAt":"2015-01-16T15:07:16.395Z"},{"title":"Fight Club","author":"Chuck Palahniuk","description":"The first rule about fight club is you don't talk about fight club.<br><br>In his debut novel, Chuck Palahniuk showed himself to be his generation's most visionary satirist. Fight Club's estranged narrator leaves his lackluster job when he comes under the thrall of Tyler Durden, an enigmatic young man who holds secret boxing matches in the basement of bars. There two men fight \"as long as they have to.\" A gloriously original work that exposes what is at the core of our modern world.","isbn":"9780393327342","length":224,"coverUrl":"http://d.gr-assets.com/books/1357128997l/5759.jpg","goodreadsId":"5759","_id":"54b9292488f375483c124644","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Mockingjay (The Hunger Games, #3)","author":"Suzanne Collins","description":"<strong>My name is Katniss Everdeen.<br>Why am I not dead?<br>I should be dead.</strong><br><br>Katniss Everdeen, girl on fire, has survived, even though her home has been destroyed.  Gale has escaped. Katniss's family is safe. Peeta has been captured by the Capitol. District 13 really does exist. There are rebels. There are new leaders. A revolution is unfolding.<br><br>It is by design that Katniss was rescued from the arena in the cruel and haunting Quarter Quell, and it is by design that she has long been part of the revolution without knowing it.  District 13 has come out of the shadows and is plotting to overthrow the Capitol. Everyone, it seems, has had a hand in the carefully laid plans--except Katniss.<br><br>The success of the rebellion hinges on Katniss's willingness to be a pawn, to accept responsibility for countless lives, and to change the course of the future of Panem. To do this, she must put aside her feelings of anger and distrust. She must become the rebels' Mockingjay--no matter what the personal cost.","isbn":"9780439023511","length":415,"coverUrl":"http://d.gr-assets.com/books/1358275419l/7260188.jpg","goodreadsId":"7260188","_id":"54b9292488f375483c124645","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Catching Fire (The Hunger Games, #2)","author":"Suzanne Collins","description":"<strong>Sparks are igniting.<br>Flames are spreading.<br>And the Capitol wants revenge.</strong><br><br>Against all odds, Katniss has won the Hunger Games.  She and fellow District 12 tribute Peeta Mellark are miraculously still alive.  Katniss should be relieved, happy even.  After all, she has returned to her family and her longtime friend, Gale.  Yet nothing is the way Katniss wishes it to be.  Gale holds her at an icy distance.  Peeta has turned his back on her completely.  And there are whispers of a rebellion against the Capitol - a rebellion that Katniss and Peeta may have helped create.<br><br>Much to her shock, Katniss has fueled an unrest she's afraid she cannot stop.  And what scares her even more is that she's not entirely convinced she should try.  As time draws near for Katniss and Peeta to visit the districts on the Capitol's cruel Victory Tour, the stakes are higher than ever.  If they can't prove, without a shadow of a doubt, that they are lost in their love for each other, the consequences will be horrifying.<br><br>In <em>Catching Fire</em>, the second novel in the Hunger Games trilogy, Suzanne Collins continues the story of Katniss Everdeen, testing her more than ever before...and surprising readers at every turn.","isbn":"9780439023498","length":405,"coverUrl":"http://d.gr-assets.com/books/1358273780l/6148028.jpg","goodreadsId":"6148028","_id":"54b9292488f375483c124646","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"The Hunger Games (The Hunger Games, #1)","author":"Suzanne Collins","description":"<strong>Winning will make you famous. <br>Losing means certain death.</strong><br><br>The nation of Panem, formed from a post-apocalyptic North America, is a country that consists of a wealthy Capitol region surrounded by 12 poorer districts. Early in its history, a rebellion led by a 13th district against the Capitol resulted in its destruction and the creation of an annual televised event known as the Hunger Games. In punishment, and as a reminder of the power and grace of the Capitol, each district must yield one boy and one girl between the ages of 12 and 18 through a lottery system to participate in the games. The 'tributes' are chosen during the annual Reaping and are forced to fight to the death, leaving only one survivor to claim victory.<br><br>When 16-year-old Katniss's young sister, Prim, is selected as District 12's female representative, Katniss volunteers to take her place. She and her male counterpart Peeta, are pitted against bigger, stronger representatives, some of whom have trained for this their whole lives. , she sees it as a death sentence. But Katniss has been close to death before. For her, survival is second nature.","isbn":"9780439023481","length":374,"coverUrl":"http://d.gr-assets.com/books/1358275334l/2767052.jpg","goodreadsId":"2767052","_id":"54b9292488f375483c124647","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Scott Pilgrim & the Infinite Sadness (Scott Pilgrim, #3)","author":"Bryan Lee O'Malley","description":"Ramona's third evil boyfriend, Todd Ingram, is currently dating the former love of Scott Ingram's life! Envy Adams broke Scott's heart a over a year ago, but now she and her evil art-rock band are back - and they want Scott's band to open their show two days from now!","isbn":"9781932664225","length":192,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"29802","_id":"54b9292488f375483c124648","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Scott Pilgrim Vs. the Universe (Scott Pilgrim, #5)","author":"Bryan Lee O'Malley","description":"Scott Pilgrim just turned 24, and things couldn't possibly be better This means things are about to get infinitely worse Suddenly, TWO of Ramona's evil ex-boyfriends are in town, and they're playing dirty. His band is in turmoil, and his own exes aren't making things any easier. And what's up with Ramona, anyway? She's been acting kinda weird ever since they moved in together Scott's precious little life is coming back around to bite him in the butt, and it may not be pretty","isbn":"9781934964101","length":179,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"5989573","_id":"54b9292488f375483c124649","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Scott Pilgrim Vs. the World (Scott Pilgrim, #2)","author":"Bryan Lee O'Malley","description":"Does Scott and Ramona's burgeoning relationship have a future? Isn't Scott still supposedly dating Knives Chau? Who is Ramona's second evil ex-boyfriend, and why is he in Toronto? Who are The Clash At Demonhead, and what kind of bizarre art-punky music do they play? Who's their hot girl keyboardist, and what is Scott's relation to her? Why are they Knives Chau's new favourite band? Fights! Drama! Secrets revealed! The answers to all these questions and more!","isbn":"9781932664126","length":200,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"29801","_id":"54b9292488f375483c12464a","createdAt":"2015-01-16T15:07:16.396Z"},{"title":"Scott Pilgrim's Finest Hour (Scott Pilgrim, #6)","author":"Bryan Lee O'Malley","description":"It's finally here Six years and almost one-thousand pages have all led to this epic finale With six of Ramona's seven evil exes dispatched, it should be time for Scott Pilgrim to face Gideon Graves, the biggest and baddest of her former beaus. But didn't Ramona take off at the end of Book 5? Shouldn't that let Scott off the hook? Maybe it should, maybe it shouldn't, but one thing is for certain - all of this has been building to Scott Pilgrim's Finest Hour","isbn":"9781934964385","length":245,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"7904429","_id":"54b9292488f375483c12464b","createdAt":"2015-01-16T15:07:16.397Z"},{"title":"The Girl Who Kicked the Hornet's Nest (Millennium, #3)","author":"Stieg Larsson","description":"Lisbeth Salander hat es wieder einmal nicht geschafft. Mit einer Axt hat die Ermittlerin versucht, ihrem Erzeuger und ewigen Erzfeind Alexander Zalatschenko das Leben zu nehmen, aber der skrupellose Kriminelle, der seine Tochter zuvor lebendig begraben hatte, überlebt und jagt Salander zudem noch eine Kugel in den Kopf. Nun liegen beide mit schweren Verletzungen, aber genesend, fast Tür an Tür im selben Krankenhaus. Derweil versucht Salanders Kollege Mikael Blomkvist, Salander vom Vorwurf des dreifachen Mordes reinzuwaschen – und sticht dabei in ein wahres Wespennest aus Korruption und krimineller Energie. Und er stößt auf ein gewaltiges Komplott von Mächten, die seine Ermittlungen empfindlich zu behindern suchen. Dann gibt es weitere Morde…<br><br>Als Verblendung, Verdammnis und Vergebung des schwedischen Journalisten und Herausgebers der Zeitschrift EXPO, Stieg Larsson, als Krimi-Trilogie in Deutschland erschien, war das auch hierzulande eine kleine Sensation. Denn der Experte für Rechtsradikalismus und Neonazismus hatte mit den drei Bänden einen Maßstab gesetzt, der zeigen konnte, wohin die Reise des modernen Thrillers gehen kann. Vergebung als Abschluss der Trilogie zeigt dies vielleicht eindinglicher als die beiden Bände zuvor: Denn so atemberaubend spannend wie dieses Buch ist lange keines mehr gewesen.<br><br>2004 erlag Stieg Larsson im Alter von nur 50 Jahren unerwartet einem Herzinfarkt. Was er an schmalem Werk aber hinterlassen hat, gehört zum besten, was die Krimiliteratur in letzter Zeit zu bieten hatte. -- Stefan Kellerer","isbn":"9780307269997","length":563,"coverUrl":"http://d.gr-assets.com/books/1327708260l/6892870.jpg","goodreadsId":"6892870","_id":"54b9292488f375483c12464c","createdAt":"2015-01-16T15:07:16.397Z"},{"title":"The Girl Who Played with Fire (Millennium, #2)","author":"Stieg Larsson","description":"Mikael Blomkvist, crusading journalist and publisher of the magazine <em>Millennium,</em> has decided to run a story that will expose an extensive sex trafficking operation between Eastern Europe and Sweden, implicating well-known and highly placed members of Swedish society, business, and government.<br><br>But he has no idea just how explosive the story will be until, on the eve of publication, the two investigating reporters are murdered. And even more shocking for Blomkvist: the fingerprints found on the murder weapon belong to Lisbeth Salander—the troubled, wise-beyond-her-years genius hacker who came to his aid in <em>The Girl with the Dragon Tattoo,</em> and who now becomes the focus and fierce heart of <em>The Girl Who Played with Fire.</em><br><br>As Blomkvist, alone in his belief in Salander’s innocence, plunges into an investigation of the slayings, Salander herself is drawn into a murderous hunt in which she is the prey, and which compels her to revisit her dark past in an effort to settle with it once and for all.","isbn":"9780307269980","length":503,"coverUrl":"http://d.gr-assets.com/books/1351778881l/5060378.jpg","goodreadsId":"5060378","_id":"54b9292488f375483c12464d","createdAt":"2015-01-16T15:07:16.397Z"},{"title":"Lullaby","author":"Chuck Palahniuk","description":"Carl Streator is a reporter investigating Sudden Infant Death Syndrome for a soft-news feature. After responding to several calls with paramedics, he notices that all the dead children were read the same poem from the same library book the night before they died. It's a 'culling song' - an ancient African spell for euthanising sick or old people. Researching it, he meets a woman who killed her own child with it accidentally. He himself accidentally killed his own wife and child with the same poem twenty years earlier. Together, the man and the woman must find and destroy all copies of this book, and try not to kill every rude sonofabitch that gets in their way. <em>Lullaby</em> is a comedy/drama/tragedy. In that order. It may also be Chuck Palahniuk's best book yet.","isbn":"9780099437963","length":260,"coverUrl":"http://d.gr-assets.com/books/1327268513l/22206.jpg","goodreadsId":"22206","_id":"54b9292488f375483c12464e","createdAt":"2015-01-16T15:07:16.397Z"},{"title":"The Information: A History, a Theory, a Flood","author":"James Gleick","description":"James Gleick, the author of the best sellers <em>Chaos</em> and <em>Genius,</em> now brings us a work just as astonishing and masterly: a revelatory chronicle and meditation that shows how information has become the modern era’s defining quality—the blood, the fuel, the vital principle of our world. <br> <br>The story of information begins in a time profoundly unlike our own, when every thought and utterance vanishes as soon as it is born. From the invention of scripts and alphabets to the long-misunderstood talking drums of Africa, Gleick tells the story of information technologies that changed the very nature of human consciousness. He provides portraits of the key figures contributing to the inexorable development of our modern understanding of information: Charles Babbage, the idiosyncratic inventor of the first great mechanical computer; Ada Byron, the brilliant and doomed daughter of the poet, who became the first true programmer; pivotal figures like Samuel Morse and Alan Turing; and Claude Shannon, the creator of information theory itself.<br> <br>And then the information age arrives. Citizens of this world become experts willy-nilly: aficionados of bits and bytes. And we sometimes feel we are drowning, swept by a deluge of signs and signals, news and images, blogs and tweets. <em>The Information</em> is the story of how we got here and where we are heading.","isbn":"9780375423727","length":527,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"8701960","_id":"54b9292488f375483c12464f","createdAt":"2015-01-16T15:07:16.397Z"},{"title":"Do Androids Dream of Electric Sheep?","author":"Philip K. Dick","description":"A final, apocalyptic, world war has killed millions, driving entire species into extinction and sending the majority of mankind off-planet. Those who remain, venerate all remaining examples of life, and owning an animal of your own is both a symbol of status and a necessity. For those who can't afford an authentic animal, companies build incredibly realistic simulacrae: horses, birds, cats, sheep . . . even humans.","isbn":"9780345404473","length":244,"coverUrl":"http://d.gr-assets.com/books/1327865673l/7082.jpg","goodreadsId":"7082","_id":"54b9292488f375483c124650","createdAt":"2015-01-16T15:07:16.398Z"},{"title":"The Time Traveler's Wife","author":"Audrey Niffenegger","description":"A dazzling novel in the most untraditional fashion, this is the remarkable story of Henry DeTamble, a dashing, adventuresome librarian who travels involuntarily through time, and Clare Abshire, an artist whose life takes a natural sequential course. Henry and Clare's passionate love affair endures across a sea of time and captures the two lovers in an impossibly romantic trap, and it is Audrey Niffenegger's cinematic storytelling that makes the novel's unconventional chronology so vibrantly triumphant.<br><br>An enchanting debut and a spellbinding tale of fate and belief in the bonds of love, <em>The Time Traveler's Wife</em> is destined to captivate readers for years to come.<br>","isbn":"9780965818674","length":518,"coverUrl":"http://d.gr-assets.com/books/1274656075l/14050.jpg","goodreadsId":"14050","_id":"54b9292488f375483c124651","createdAt":"2015-01-16T15:07:16.398Z"},{"title":"Zone One","author":"Colson Whitehead","description":"In this wry take on the post-apocalyptic horror novel, a pandemic has devastated the planet. The plague has sorted humanity into two types: the uninfected and the infected, the living and the living dead. <br><br>Now the plague is receding, and Americans are busy rebuild­ing civilization under orders from the provisional govern­ment based in Buffalo. Their top mission: the resettlement of Manhattan. Armed forces have successfully reclaimed the island south of Canal Street—aka Zone One—but pockets of plague-ridden squatters remain. While the army has eliminated the most dangerous of the infected, teams of civilian volunteers are tasked with clearing out a more innocuous variety—the “malfunctioning” stragglers, who exist in a catatonic state, transfixed by their former lives. <br><br>Mark Spitz is a member of one of the civilian teams work­ing in lower Manhattan. Alternating between flashbacks of Spitz’s desperate fight for survival during the worst of the outbreak and his present narrative, the novel unfolds over three surreal days, as it depicts the mundane mission of straggler removal, the rigors of Post-Apocalyptic Stress Disorder, and the impossible job of coming to grips with the fallen world. <br><br>And then things start to go wrong. <br><br>Both spine chilling and playfully cerebral, <em>Zone One</em> bril­liantly subverts the genre’s conventions and deconstructs the zombie myth for the twenty-first century.","isbn":"9780385528078","length":259,"coverUrl":"http://d.gr-assets.com/books/1327888785l/10365343.jpg","goodreadsId":"10365343","_id":"54b9292488f375483c124652","createdAt":"2015-01-16T15:07:16.398Z"},{"title":"Super Mario: How Nintendo Conquered America","author":"Jeff   Ryan","description":"<strong>The story of Nintendo's rise and the beloved icon who made it possible. </strong> <br><br> Nintendo has continually set the standard for video-game innovation in America, starting in 1981 with a plucky hero who jumped over barrels to save a girl from an ape. <br><br> The saga of Mario, the portly plumber who became the most successful franchise in the history of gaming, has plot twists worthy of a video game. Jeff Ryan shares the story of how this quintessentially Japanese company found success in the American market. Lawsuits, Hollywood, die- hard fans, and face-offs with Sony and Microsoft are all part of the drama. <br><br> Find out about: <br><br> *\tMario's eccentric yet brilliant creator, Shigeru Miyamoto, who was tapped for the job because was considered expendable. <br><br> *\tMinoru Arakawa, the son-in-law of Nintendo's imperious president, who bumbled his way to success. <br><br> *\tThe unexpected approach that allowed Nintendo to reinvent itself as the gaming system for the non-gamer, especially now with the Wii.<br><br> Even those who can't tell a Koopa from a Goomba will find this a fascinating story of striving, comeuppance, and redemption.","isbn":"9781591844051","length":292,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"10660230","_id":"54b9292488f375483c124653","createdAt":"2015-01-16T15:07:16.398Z"},{"title":"The Bell Jar","author":"Sylvia Plath","description":"Esther Greenwood is at college and is fighting two battles, one against her own desire for perfection in all things - grades, boyfriend, looks, career - and the other against remorseless mental illness. As her depression deepens she finds herself encased in it, bell-jarred away from the rest of the world. This is the story of her journey back into reality. Highly readable, witty and disturbing, The Bell Jar is Sylvia Plath's only novel and was originally published under a pseudonym in 1963. What it has to say about what women expect of themselves, and what society expects of women, is as sharply relevant today as it has always been.","isbn":"9780571226160","length":234,"coverUrl":"http://d.gr-assets.com/books/1420292584l/774308.jpg","goodreadsId":"774308","_id":"54b9292488f375483c124654","createdAt":"2015-01-16T15:07:16.398Z"},{"title":"Bossypants","author":"Tina Fey","description":"Before Liz Lemon, before \"Weekend Update,\" before \"Sarah Palin,\" Tina Fey was just a young girl with a dream: a recurring stress dream that she was being chased through a local airport by her middle-school gym teacher. She also had a dream that one day she would be a comedian on TV.<br><br>She has seen both these dreams come true.<br><br>At last, Tina Fey's story can be told. From her youthful days as a vicious nerd to her tour of duty on <em>Saturday Night Live</em>; from her passionately halfhearted pursuit of physical beauty to her life as a mother eating things off the floor; from her one-sided college romance to her nearly fatal honeymoon—from the beginning of this paragraph to this final sentence.<br><br>Tina Fey reveals all, and proves what we've all suspected: you're no one until someone calls you bossy.<br><br><em>(Includes Special, Never-Before-Solicited Opinions on Breastfeeding, Princesses, Photoshop, the Electoral Process, and Italian Rum Cake!)</em><br><br><em>An unabridged recording on 5 CDs (5.5 Hours).</em>","isbn":"9781609419691","length":5,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"9418327","_id":"54b9292488f375483c124655","createdAt":"2015-01-16T15:07:16.399Z"},{"title":"11/22/63","author":"Stephen King","description":"Life can turn on a dime—or stumble into the extraordinary, as it does for Jake Epping, a high school English teacher in Lisbon Falls, Maine. While grading essays by his GED students, Jake reads a gruesome, enthralling piece penned by janitor Harry Dunning: fifty years ago, Harry somehow survived his father’s sledgehammer slaughter of his entire family. Jake is blown away...but an even more bizarre secret comes to light when Jake’s friend Al, owner of the local diner, enlists Jake to take over the mission that has become his obsession—to prevent the Kennedy assassination. How? By stepping through a portal in the diner’s storeroom, and into the era of Ike and Elvis, of big American cars, sock hops, and cigarette smoke... Finding himself in warmhearted Jodie, Texas, Jake begins a new life. But all turns in the road lead to a troubled loner named Lee Harvey Oswald. The course of history is about to be rewritten...and become heart-stoppingly suspenseful.<br><br>------------------------------------------------------------<br><br><strong> The following is the Library of Congress Summary</strong><br><br>    On November 22, 1963, three shots rang out in Dallas, President Kennedy died, and the world changed. What if you could change it back? The author's new novel is about a man who travels back in time to prevent the JFK assassination. In this novel that is a tribute to a simpler era, he sweeps readers back in time to another moment, a real life moment, when everything went wrong: the JFK assassination. And he introduces readers to a character who has the power to change the course of history. Jake Epping is a thirty-five-year-old high school English teacher in Lisbon Falls, Maine, who makes extra money teaching adults in the GED program. He receives an essay from one of the students, a gruesome, harrowing first person story about the night fifty years ago when Harry Dunning's father came home and killed his mother, his sister, and his brother with a hammer. Harry escaped with a smashed leg, as evidenced by his crooked walk. Not much later, Jake's friend Al, who runs the local diner, divulges a secret: his storeroom is a portal to 1958. He enlists Jake on an insane, and insanely possible, mission to try to prevent the Kennedy assassination. So begins Jake's new life as George Amberson and his new world of Elvis and JFK, of big American cars and sock hops, of a troubled loner named Lee Harvey Oswald and a beautiful high school librarian named Sadie Dunhill, who becomes the love of Jake's life, a life that transgresses all the normal rules of time.<br><br>------------------------------------------------------------<br><br>~","isbn":"9781451627282","length":849,"coverUrl":"http://d.gr-assets.com/books/1327876792l/10644930.jpg","goodreadsId":"10644930","_id":"54b9292488f375483c124656","createdAt":"2015-01-16T15:07:16.399Z"},{"title":"Divergent (Divergent, #1)","author":"Veronica Roth","description":"<p>In Beatrice Prior's dystopian Chicago, society is divided into five factions, each dedicated to the cultivation of a particular virtue--Candor (the honest), Abnegation (the selfless), Dauntless (the brave), Amity (the peaceful), and Erudite (the intelligent). On an appointed day of every year, all sixteen-year-olds must select the faction to which they will devote the rest of their lives. For Beatrice, the decision is between staying with her family and being who she really is--she can't have both. So she makes a choice that surprises everyone, including herself.<br><br>During the highly competitive initiation that follows, Beatrice renames herself Tris and struggles to determine who her friends really are--and where, exactly, a romance with a sometimes fascinating, sometimes infuriating boy fits into the life she's chosen. But Tris also has a secret, one she's kept hidden from everyone because she's been warned it can mean death. And as she discovers a growing conflict that threatens to unravel her seemingly perfect society, she also learns that her secret might help her save those she loves . . . or it might destroy her.</p>","isbn":"9780062024022","length":487,"coverUrl":"http://d.gr-assets.com/books/1327873996l/8306857.jpg","goodreadsId":"8306857","_id":"54b9292488f375483c124657","createdAt":"2015-01-16T15:07:16.399Z"},{"title":"The Girl with the Dragon Tattoo (Millennium, #1)","author":"Stieg Larsson","description":"<p>Mikael Blomkvist, a once-respected financial journalist, watches his professional life rapidly crumble around him. Prospects appear bleak until an unexpected (and unsettling) offer to resurrect his name is extended by an old-school titan of Swedish industry. The catch—and there's always a catch—is that Blomkvist must first spend a year researching a mysterious disappearance that has remained unsolved for nearly four decades. With few other options, he accepts and enlists the help of investigator Lisbeth Salander, a misunderstood genius with a cache of authority issues. Little is as it seems in Larsson's novel, but there is at least one constant: you really don't want to mess with the girl with the dragon tattoo.</p>","isbn":"9780307269751","length":465,"coverUrl":"http://d.gr-assets.com/books/1327868566l/2429135.jpg","goodreadsId":"2429135","_id":"54b9292488f375483c124658","createdAt":"2015-01-16T15:07:16.400Z"},{"title":"Ender in Exile (The Ender Quintet, #1.6)","author":"Orson Scott Card","description":"What happened during the years between \"Ender's Game\" and \"Speaker for the Dead\"? What did Ender go through from the ages of 12 through 35? The story of those years has never been told. Taking place 3000 years before Ender finally receives his chance at redemption in \"Speaker for the Dead\", this is the long-lost story of Ender. For twenty-three years, millions of readers have wondered and now they will receive the answers. \"Ender in Exile\" is Orson Scott Card's moving return to all the action and the adventure, the profound exploration of war and society, and the characters one never forgot. On one of these ships, there is a baby that just may share the same special gifts as Ender's old friend Bean...","isbn":"9780765304964","length":380,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"3220405","_id":"54b9292488f375483c124659","createdAt":"2015-01-16T15:07:16.400Z"},{"title":"Steve Jobs","author":"Walter Isaacson","description":"From best-selling author Walter Isaacson comes the landmark biography of Apple co-founder Steve Jobs.<br><br>In Steve Jobs: The Exclusive Biography, Isaacson provides an extraordinary account of Jobs' professional and personal life. Drawn from three years of exclusive and unprecedented interviews Isaacson has conducted with Jobs as well as extensive interviews with Jobs' family members and key colleagues from Apple and its competitors, Steve Jobs: The Exclusive Biography is the definitive portrait of the greatest innovator of his generation.<br><br>With an introduction read by the author.<br><br>©2011 Walter Isaacson (P)2011 Simon &amp; Schuster Inc","isbn":"9781451648539","length":656,"coverUrl":"http://d.gr-assets.com/books/1327861368l/11084145.jpg","goodreadsId":"11084145","_id":"54b9292488f375483c12465a","createdAt":"2015-01-16T15:07:16.400Z"},{"title":"Ender's Shadow (Ender's Shadow, #1)","author":"Orson Scott Card","description":"Welcome to Battleschool. <br><br>Growing up is never easy. But try living on the mean streets as a child begging for food and fighting like a dog with ruthless gangs of starving kids who wouldn't hesitate to pound your skull into pulp for a scrap of apple. If Bean has learned anything on the streets, it's how to survive. And not with fists. He is way too small for that. But with brains.<br><br>Bean is a genius with a magician's ability to zero in on his enemy and exploit his weakness.<br><br>What better quality for a future general to lead the Earth in a final climactic battle against a hostile alien race, known as Buggers. At Battleschool Bean meets and befriends another future commander - Ender Wiggins - perhaps his only true rival.<br><br>Only one problem: for Bean and Ender, the future is now.<br>","isbn":"9780765342409","length":469,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"9532","_id":"54b9292488f375483c12465b","createdAt":"2015-01-16T15:07:16.401Z"},{"title":"Pattern Recognition (Blue Ant, #1)","author":"William Gibson","description":"Cayce Pollard is an expensive, spookily intuitive market-research consultant. In London on a job, she is offered a secret assignment: to investigate some intriguing snippets of video that have been appearing on the Internet. An entire subculture of people is obsessed with these bits of footage, and anybody who can create that kind of brand loyalty would be a gold mine for Cayce's client. But when her borrowed apartment is burgled and her computer hacked, she realizes there's more to this project than she had expected.<br><br>Still, Cayce is her father's daughter, and the danger makes her stubborn. Win Pollard, ex-security expert, probably ex-CIA, took a taxi in the direction of the World Trade Center on September 11 one year ago, and is presumed dead. Win taught Cayce a bit about the way agents work. She is still numb at his loss, and, as much for him as for any other reason, she refuses to give up this newly weird job, which will take her to Tokyo and on to Russia. With help and betrayal from equally unlikely quarters, Cayce will follow the trail of the mysterious film to its source, and in the process will learn something about her father's life and death.","isbn":"9780425198681","length":367,"coverUrl":"http://d.gr-assets.com/books/1288326931l/22320.jpg","goodreadsId":"22320","_id":"54b9292488f375483c12465c","createdAt":"2015-01-16T15:07:16.401Z"},{"title":"The Dark Fields","author":"Alan Glynn","description":"Imagine a drug that makes your brain function with perfect efficiency, tapping into your most fundamental resources of intelligence and drive, releasing all the passive knowledge you'd ever accumulated. A drug that made you focused, charming, fast, even attractive. Eddie Spinola is on such a drug. It's called MDT-48, and it's Viagra for the brain-a designer drug that's redesigning his life. But while MDT is helping Eddie achieve the kind of success he's only dreamed about, it's also chipping away at his sanity-splitting headaches, spontaneous blackouts, violent outbursts. And now that he's hooked and his supply is running low, Eddie must venture into the drug's dark past to feed his habit. What he discovers proves that MDT, once a dream come true, has become his worst nightmare. <p></p>","isbn":"9781582342733","length":341,"coverUrl":"http://d.gr-assets.com/books/1312026865l/416482.jpg","goodreadsId":"416482","_id":"54b9292488f375483c12465d","createdAt":"2015-01-16T15:07:16.401Z"},{"title":"Ready Player One","author":"Ernest Cline","description":"It's the year 2044, and the real world is an ugly place.<br><br>Like most of humanity, Wade Watts escapes his grim surroundings by spending his waking hours jacked into the OASIS, a sprawling virtual utopia that lets you be anything you want to be, a place where you can live and play and fall in love on any of ten thousand planets. <br><br>And like most of humanity, Wade dreams of being the one to discover the ultimate lottery ticket that lies concealed within this virtual world. For somewhere inside this giant networked playground, OASIS creator James Halliday has hidden a series of fiendish puzzles that will yield massive fortune -- and remarkable power -- to whoever can unlock them. <br><br>For years, millions have struggled fruitlessly to attain this prize, knowing only that Halliday's riddles are based in the pop culture he loved -- that of the late twentieth century. And for years, millions have found in this quest another means of escape, retreating into happy, obsessive study of Halliday's icons. Like many of his contemporaries, Wade is as comfortable debating the finer points of John Hughes's oeuvre, playing Pac-Man, or reciting Devo lyrics as he is scrounging power to run his OASIS rig. <br><br>And then Wade stumbles upon the first puzzle. <br><br>Suddenly the whole world is watching, and thousands of competitors join the hunt -- among them certain powerful players who are willing to commit very real murder to beat Wade to this prize. Now the only way for Wade to survive and preserve everything he knows is to win. But to do so, he may have to leave behind his oh-so-perfect virtual existence and face up to life -- and love -- in the real world he's always been so desperate to escape. <br><br>A world at stake. <br>A quest for the ultimate prize. <br>Are you ready?","isbn":"9780307887436","length":374,"coverUrl":"http://d.gr-assets.com/books/1406383612l/9969571.jpg","goodreadsId":"9969571","_id":"54b9292488f375483c12465e","createdAt":"2015-01-16T15:07:16.401Z"},{"title":"Ender's Game (The Ender Quintet, #1)","author":"Orson Scott Card","description":"In order to develop a secure defense against a hostile alien race's next attack, government agencies breed child geniuses and train them as soldiers. A brilliant young boy, Andrew \"Ender\" Wiggin lives with his kind but distant parents, his sadistic brother Peter, and the person he loves more than anyone else, his sister Valentine. Peter and Valentine were candidates for the soldier-training program but didn't make the cut—young Ender is the Wiggin drafted to the orbiting Battle School for rigorous military training.<br><br>Ender's skills make him a leader in school and respected in the Battle Room, where children play at mock battles in zero gravity. Yet growing up in an artificial community of young soldiers Ender suffers greatly from isolation, rivalry from his peers, pressure from the adult teachers, and an unsettling fear of the alien invaders. His psychological battles include loneliness, fear that he is becoming like the cruel brother he remembers, and fanning the flames of devotion to his beloved sister. <br><br>Is Ender the general Earth needs? But Ender is not the only result of the genetic experiments. The war with the Buggers has been raging for a hundred years, and the quest for the perfect general has been underway for almost as long. Ender's two older siblings are every bit as unusual as he is, but in very different ways. Between the three of them lie the abilities to remake a world. If, that is, the world survives.<br><br>Ender's Game is the winner of the 1985 Nebula Award for Best Novel and the 1986 Hugo Award for Best Novel.","isbn":"9780812550702","length":324,"coverUrl":"http://d.gr-assets.com/books/1408303130l/375802.jpg","goodreadsId":"375802","_id":"54b9292488f375483c12465f","createdAt":"2015-01-16T15:07:16.401Z"},{"title":"Acide sulfurique","author":"Amélie Nothomb","description":"« Vint le moment où la souffrance des autres ne leur suffit plus : il leur en fallut le spectacle. »<br><br>Concentration : la dernière-née des émissions télévisées. On enlève des gens, on recrute des kapos, on filme… Tout de suite, le plus haut score de téléspectateurs, l’audimat absolu qui se nourrit autant de la cruauté filmée que de l’horreur dénoncée.<br>Etudiante à la beauté stupéfiante, Pannonique est devenue CKZ 114 dans le camp de concentration télévisé. Le premier sévice étant la perte de son nom, partant de son identité.<br>Zdena, chômeuse devenue la kapo Zdena, découvre en Pannonique son double inversé et se met à l’aimer éperdument. Le bien et le mal en couple fatal, la victime et le bourreau, la belle et la bête aussi.<br>Quand les organisateurs du jeu, pour stimuler encore l’audience, décident de faire voter le public pour désigner les prisonniers à abattre, un tollé médiatique s’élève mais personne ne s’abstient de voter et Pannonique joue sa vie…","isbn":"9782286016722","length":198,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"933802","_id":"54b9292488f375483c124660","createdAt":"2015-01-16T15:07:16.402Z"},{"title":"The Stranger","author":"Albert Camus","description":"This is an alternate cover edition for ISBN 0679720200.<br><br>Through the story of an ordinary man unwittingly drawn into a senseless murder on an Algerian beach, Camus explored what he termed \"the nakedness of man faced with the absurd.\" First published in English in 1946; now in a new translation by Matthew Ward.","length":123,"coverUrl":"http://d.gr-assets.com/books/1349927872l/49552.jpg","goodreadsId":"49552","_id":"54b9292488f375483c124661","createdAt":"2015-01-16T15:07:16.402Z"},{"title":"The Rules of Attraction","author":"Bret Easton Ellis","description":"Set at a small, affluent liberal-arts college in New England at the height of the Reagan 80s, <strong>The Rules of Attraction</strong> is a startlingly funny, kaleidoscopic novel about three students with no plans for the future--or even the present--who become entangled in a curious romantic triangle. Bret Easton Ellis trains his incisive gaze on the kids at self-consciously bohemian Camden College and treats their sexual posturings and agonies with a mixture of acrid hilarity and compassion while exposing the moral vacuum at the center of their lives.<br><br>Lauren changes boyfriends every time she changes majors and still pines for Victor who split for Europe months ago and she might or might not be writing anonymous love letter to ambivalent, hard-drinking Sean, a hopeless romantic who only has eyes for Lauren, even if he ends up in bed with half the campus, and Paul, Lauren's ex, forthrightly bisexual and whose passion masks a shrewd pragmatism. They waste time getting wasted, race from Thirsty Thursday Happy Hours to Dressed To Get Screwed parties to drinks at The Edge of the World or The Graveyard. <strong>The Rules of Attraction</strong> is a poignant, hilarious take on the death of romance.","isbn":"9780679781486","length":283,"coverUrl":"http://s.gr-assets.com/assets/nophoto/book/111x148-c93ac9cca649f584bf7c2539d88327a8.png","goodreadsId":"9912","_id":"54b9292488f375483c124662","createdAt":"2015-01-16T15:07:16.402Z"}]